# 物不知数
# “物不知数”出自《孙子算经》。题目如下：
# “今有物不知其数，一一数之剩零，二二数之剩一，三三数之剩零，四四数之剩一，五
# 五数之剩一，六六数之剩三，七七数之剩零,八八数之剩一，九九数之剩零，问物几何？”
# 请问物品可能有多少个？
#输入一个正整数，从小到大依次输出所有不超过输入数字且满足条件的物品数量，有多个答案时每行输出一个

#利用列表进行解决 简化代码量
#方法一
n = int(input())
lst = [0, 1, 0, 1, 1, 3, 0, 1, 0]
for i in range(n):
    if [i % x for x in range(1, 10)] == lst: #此处运用了列表推导式
        print(i)

#方法二
# n = int(input())
# # 从0遍历到n
# for i in range(n):
#     # 如果满足一一数之剩零，二二数之剩一，三三数之剩零，四四数之剩一，五五数之剩一，六六数之剩三，七七数之剩零,八八数之剩一，九九数之剩零就输出
#     if i % 2 == 1 and i % 3 == 0 and i % 4 == 1 and i % 5 == 1 and i % 6 == 3 \
#             and i % 7 == 0 and i % 8 == 1 and i % 9 == 0:
#         print(i)